#+TITLE: Nix Builds of Haskell Language Server (HLS)
#+SETUPFILE: ./doc/links.org

[[https://github.com/shajra/nix-haskell-hls/actions][https://github.com/shajra/nix-haskell-hls/workflows/CI/badge.svg]]

* This project's Nix expression

  The Nix expression provided by this project ([[./default.nix][./default.nix]]) evaluates to a
  function that outputs an /attribute set/ of /package derivations/.  This
  function has some default arguments that can be explicitly overridden.  Nix
  CLI tools like =nix= and =nix-env= allow us do to this overriding with the
  =--argstr= and =--arg= switches.

  For this project's Nix expression, the following overrides can be done:

  - ~--argstr ghcVersion ${GHC_VERSION}~ sets the GHC version used for the build
    (the default is otherwise {{{ghcVersion-default(~,~)}}}).
  - ~--arg hlsUnstable ${BOOLEAN_VALUE}~ when set to ~true~ picks a recent
    commit from the "master" branch for the HLS packages (defaulting otherwise
    to ~false~, which selects the {{{version-hls-latest}}} release of HLS).

  We can see the package derivations provided with following =nix= calls:

  #+BEGIN_SRC shell :eval no
    nix show-derivation --file . > /dev/null
    nix search --no-cache --file .
  #+END_SRC

  #+NAME: nix-derivation-search
  #+BEGIN_SRC shell :results output :exports results
    nix show-derivation --file . > /dev/null
    nix search --no-cache --file . | ansifilter
  #+END_SRC

  #+RESULTS: nix-derivation-search
  #+begin_example
  ,* cabal-install (cabal-install)
    The command-line interface for Cabal and Hackage

  ,* direnv (direnv)
    A shell extension that manages your environment

  ,* direnv-nix-lorelei (direnv-nix-lorelei)
    Alternative Nix functions for Direnv

  ,* ghc (ghc)
    The Glasgow Haskell Compiler

  ,* hls (haskell-language-server-ghc884)
    Haskell Language Server (HLS) for GHC 8.8.4

  ,* hls-renamed (haskell-language-server-ghc884-renamed)
    Haskell Language Server (HLS) for GHC 8.8.4, renamed binary

  ,* hls-wrapper (haskell-language-server-wrapper)
    Haskell Language Server (HLS) wrapper

  ,* hls-wrapper-nix (hls-wrapper-nix)
    Haskell Language Server (HLS) wrapper for Nix

  ,* implicit-hie (implicit-hie)
    Auto generate hie-bios cradles & hie.yaml

  ,* stack (stack)
    The Haskell Tool Stack

  ,* stack-nix (stack-args)
    Haskell Stack with args: --nix

  ,* stack-nonix (stack-args)
    Haskell Stack with args: --no-nix --system-ghc

  #+end_example

  Note, when loading a directory with ~--file~, a Nix expression is assumed to
  be in the directory's =default.nix= file.  Also, the call of =nix
  show-derivation= is only needed one time to get search results as discussed in
  [[file:doc/nix.org][the provided documentation on Nix]].

  The search results of =nix search= tell us the /attribute paths/ we can use to
  select out the package derivations from our Nix expression.  Above we got the
  default {{{version-hls-latest}}} version of HLS packages compiled for GHC
  {{{version-ghc-default}}}.  We could have explicitly called =nix search= above
  with {{{ghcVersion-default(~--argstr ghcVersion ,~)}}} and ~--arg hlsUnstable false~
  and have gotten the same default results.

  The =hls= package is provided for completeness, but its usage is not generally
  recommended.  It provides the unmodified output of the upstream HLS project,
  specifically a binary named "haskell-language-server".  You can only install
  one of these to your =PATH=.  Because the version of GHC we compile HLS
  against must match the version of GHC for the project we wish to use HLS with,
  using =hls= would limit all of our projects to just one version of GHC.  The
  =hls-renamed=, =hls-wrapper=, and =hls-wrapper-nix= packages help work around
  this limitation, and are recommended.

  To install multiple instances of HLS to your =PATH=, use the =hls-renamed=
  attribute path.  This suffixes the provided binary's filename with the version
  of GHC the instance of HLS has been compiled with.  For example, when compiled
  with GHC {{{version-ghc-default}}}, the binary is named
  "haskell-language-server-{{{version-ghc-default}}}".

  The =hls-wrapper= attribute path provides the upstream HLS wrapper binary
  named "haskell-language-server-wrapper".  When the wrapper is run in a root
  directory of a Haskell project, it detects which GHC version is needed by the
  project, and scans the =PATH= to call the instance of the renamed HLS binary
  compiled for the version of GHC needed by the project.  It doesn't really
  matter which version of GHC you compile the wrapper itself against (~--argstr
  ghcVersion~).  It's just a thin wrapper that is not GHC-sensitive.

  The =hls-wrapper-nix= attribute path provides a wrapper of =hls-wrapper= that
  additionally helps enter into a Nix shell.

  As a convenience, this project provides a way to get some tools to assist
  building with HLS, specifically =cabal-install=, =ghc=, =stack=, =stack-nix=,
  =stack-nonix=, =implicit-hie=, =direnv=, and =direnv-nix-lorelei=.  The ~--arg
  hlsUnstable~ has no relevance to or impact on any of these packages.  With the
  exception of =ghc=, ~--argstr ghcVersion~ has no impact on these either.

  =ghc= provides GHC at a version that is specified with ~argstr ghcVersion~.

  =cabal= and =stack= provide packages whose derivations are just passed through
  from [[nixpkgs][Nixpkgs]] for Cabal and Stack, respectively.  =stack-nix= and =stack-nonix=
  are small shell wrappers around the =stack= executable that forcibly inject
  ~--nix~ and ~--no-nix --system-ghc~ switches, respectively, on each
  invocation.

  The =implicit-hie= attribute provides a executable named =gen-hie=, which
  ideally you shouldn't need, but may be helpful in some circumstances when
  using HLS.

  And lastly, the =direnv= and =direnv-nix-lorelei= attribute paths provide the
  [[direnv][Direnv]] package and [[direnv-nix-lorelei][Lorelei]], a Nix plugin for it.  We can use these together to
  integrate our editor with =nix-shell= as an alternative to =hls-wrapper-nix=.

** Example user-level installation

   To install programs into the user-level =PATH= with Nix, we generally use
   =nix-env=.  When installing programs with =nix-env= we typically have
   =~/.nix-profile/bin= in our environment's =PATH=.  =~/.nix-profile= is a
   symlink that points to our /active profile/, and calls to =nix-env= install
   to this location.

   To illustrate installing with =nix-env= let's consider installing the
   following:

   - this project's drop-in replacement for the HLS wrapper
   - the latest release of HLS ({{{version-hls-latest}}}) targeting
     {{{version-ghc-default}}}
   - useful recent stable versions of Cabal, Stack, =gen-hie=, Direnv, and
     Lorelei
   - GHC {{{version-ghc-latest}}}
   - a recent "master" branch version of HLS targeting GHC 8.10.2.

   We can install the first three in one step relying on defaults of the Nix
   expression:

   #+NAME: nix-env-install-most
   #+BEGIN_SRC shell :session env :results output silent
     nix-env --install --file . \
         --attr hls-renamed \
         --attr hls-wrapper-nix \
         --attr cabal-install \
         --attr stack \
         --attr implicit-hie \
         --attr direnv \
         --attr direnv-nix-lorelei
   #+END_SRC

   Note, because we want multiple instances of HLS on our =PATH= we use
   =hls-renamed= instead of =hls=.

   Next we can install another version of GHC as well as an instance of HLS
   targeting it using ~--argstr ghcVersion~, and with ~--arg hlsUnstable~ we can
   select a recent "master" branch version of HLS:

   #+NAME: nix-env-install-rest
   #+BEGIN_SRC shell :session env :results output silent
     nix-env --install --file . \
         --argstr ghcVersion ghc8102 \
         --arg hlsUnstable true \
         --attr ghc \
         --attr hls-renamed
   #+END_SRC

   These packages have been installed in our Nix profile, which we can see by
   querying our profile with =nix-env=:

   #+NAME: nix-env-query
   #+BEGIN_SRC shell :session env :results output :exports both
     nix-env --query
   #+END_SRC

   #+RESULTS: nix-env-query
   : cabal-install-3.2.0.0
   : direnv-2.22.0
   : direnv-nix-lorelei
   : ghc-8.10.2
   : haskell-language-server-ghc8102-renamed
   : haskell-language-server-ghc884-renamed
   : hls-wrapper-nix
   : implicit-hie-0.1.2.5
   : stack-2.5.1.1

   If we've set up the =bin= directory of our Nix profile in our =PATH=, we
   should be able to see what we've installed as available.  For instance, we
   should be able to the see the version of GHC is as expected:

   #+NAME: nix-env-versions
   #+BEGIN_SRC shell :session env :results output :exports both
     ghc --version
   #+END_SRC

   #+RESULTS: nix-env-versions
   : The Glorious Glasgow Haskell Compilation System, version 8.10.2

   Without using =nix-shell=, Cabal and Stack will both manage Haskell
   dependencies of projects.  In this case, for Cabal you need to at least once
   call ~cabal update~ to download the latest index of Haskell packages on
   Hackage:

   #+BEGIN_SRC shell :eval no
     cabal update
   #+END_SRC

   For Stack, you don't have to explicitly call anything to get an index of
   Haskell packages.

* Project-level Nix shells

  Sometimes we can't address all of our projects with one user-level
  environment.  For instance, what do we do if two projects depend on
  conflicting versions of a non-Haskell dependency?

  In these cases, we can use =nix-shell= to enter into into a Bash shell
  environment with environment variables tailored for the project.  This gives
  us full control to specify all our dependencies per-project, including
  non-Haskell libraries (like C libraries needed for FFI binding).

  Nix shells are configured in the Nix expression language saved in files with a
  ".nix" filename extension.  To learn more about the language itself, we
  recommend
  - the official Nix manual's [[nix-manual-expr][chapter on the Nix language]]
  - a [[nix-tutorial-expr][tutorial on the Nix language]].

  To learn more about writing Nix expressions for Cabal and Stack projects, see
  the [[nixpkgs-manual-haskell][Nixpkgs guide on configuring Haskell packages]].

  Authoring a Nix expression isn't a lot of code, but it's not as simple as one
  line, so this project provides some examples to help follow along.  We  have
  [[./examples/example-cabal][one for Cabal]], and [[./examples/example-stack][another for Stack]].  The Nix expressions in these examples
  include generous inline comments for guidance.  We'll use these examples to
  illustrate some steps.

  The code between these two examples is largely the same, and both have a
  dependency on the ICU C library for Unicode support, so these projects may
  likely not compile outside a Nix shell with Cabal or Stack alone (unless you
  happened to have installed globally the ICU library and header files).

  Once you have a project-level Nix expression written should you should be able
  to
  - enter into an interactive Nix shell by calling `nix shell`
  - within the shell call =cabal= or =stack= as you normally would to build
    locally (for instance, ~cabal build all~ or ~stack build~) with all needed
    dependencies set up in environment variables
  - call =haskell-language-server-wrapper=, which editors will need to call
    with the =--lsp= switch.

  We can enter a project-tailored Nix shell by calling =nix-shell= with no
  arguments in the root directory of a Haskell project that has either a
  =shell.nix= or =default.nix= file.  By default, =nix-shell= chooses
  =shell.nix= first.

  Generally, =default.nix= is used for building Nix packages for a project.  And
  =shell.nix= is used for creating a development environment for a project.
  This is the case for the Cabal-based example project.  But sometimes
  =default.nix= is usable for both, which is illustrated in the Stack-based
  example project.

  If you want to run commands within the shell non-interactively, we can use the
  =--run= switch.  For example, we can build and run our project locally with
  Cabal (the example projects both print out a silly message):

  #+NAME: shell-build-cabal
  #+BEGIN_SRC shell :results output :exports both :post crop(text=*this*, first-n=3, last-n=2)
     cd examples/example-cabal
     nix-shell --pure --run 'cabal run all'
  #+END_SRC

  #+RESULTS: shell-build-cabal
  : Resolving dependencies...
  : Build profile: -w ghc-8.10.2 -O1
  : In order, the following will be built (use -v for more details):
  : …
  : Answer to the Ultimate Question of Life,
  :     the Universe, and Everything: 42

  The =--pure= flag clears out the users current environment before building out
  a new one for the Nix shell.  This means anything anything on your path
  currently won't be available within the shell.

  A similar =nix-shell= call will build our example Stack project within a Nix
  shell:

  #+NAME: shell-build-stack
  #+BEGIN_SRC shell :results output :exports both :post crop(text=*this*, first-n=3, last-n=2)
     cd examples/example-stack
     nix-shell --pure --run 'stack run'
  #+END_SRC

  #+RESULTS: shell-build-stack
  : Answer to the Ultimate Question of Life,
  :     the Universe, and Everything: 42

  If our project builds, we can test that HLS runs correctly, which we can do
  by calling HLS with no arguments.  It should exit successfully reporting no
  failures.  Here's an illustration of a successful run in our Cabal example
  project.

  #+NAME: shell-hls-cabal
  #+BEGIN_SRC shell :results output :exports both :post crop(text=*this*, first-n=3, last-n=2)
     cd examples/example-cabal
     nix-shell --pure --run 'haskell-language-server-wrapper'
  #+END_SRC

  #+RESULTS: shell-hls-cabal
  : (haskell-language-server)Ghcide setup tester in /home/tnks/src/shajra/nix-haskell-hls/examples/example-cabal.
  : Report bugs at https://github.com/haskell/haskell-language-server/issues
  : 
  : …
  : Completed (5 files worked, 0 files failed)
  : [INFO] finish: User TypeCheck (took 0.05s)

  The same command can test HLS working with our Stack example project:

  #+NAME: shell-hls-stack
  #+BEGIN_SRC shell :results output :exports both :post crop(text=*this*, first-n=3, last-n=2)
     cd examples/example-stack
     nix-shell --pure --run 'haskell-language-server-wrapper'
  #+END_SRC

  #+RESULTS: shell-hls-stack
  : (haskell-language-server)Ghcide setup tester in /home/tnks/src/shajra/nix-haskell-hls/examples/example-stack.
  : Report bugs at https://github.com/haskell/haskell-language-server/issues
  : 
  : …
  : Completed (3 files worked, 0 files failed)
  : [INFO] finish: User TypeCheck (took 0.04s)

** Regenerating a Nix shell environment when dependencies change

   When using a Nix shell for Cabal projects, the Nix shell typically provides
   all build tools, all Haskell libraries, and also all non-Haskell libraries.
   The example Cabal project illustrates a Nix expression providing all of these
   dependencies.

   When we do this, our Nix shell is configured with a GHC with a builtin
   package database preloaded with the transitive closure of all Haskell
   dependencies needed by a project, but excluding packages of the project
   itself.  Because the third-party libraries are prebuilt upon entry into the
   Nix shell, Cabal doesn't need to download anything from Hackage.  In fact, we
   don't even need to call ~cabal update~ to retrieve the package index from
   Hackage when we set up a Nix shell this way.

   As mentioned earlier, Stack does not easily allow Nix to manage Haskell
   dependencies, so the Nix expressions we use for Stack are different, and the
   GHC instance we get in our Nix shell won't be preloaded with any Haskell
   dependencies.

   We can see the difference in the GHC instances of our example projects.  Both
   the Cabal and Stack projects depend on the Haskell =text-icu= package.  With
   the Cabal project we can see this package included with GHC:

   #+NAME: example-cabal-pkg-list
   #+BEGIN_SRC shell :results output :exports both
     cd examples/example-cabal
     nix-shell --pure --run 'ghc-pkg list text-icu'
   #+END_SRC

   #+RESULTS: example-cabal-pkg-list
   : /nix/store/hfawp7204pan3w4rfblicypj2c9drg2l-ghc-8.10.2-with-packages/lib/ghc-8.10.2/package.conf.d
   :     text-icu-0.7.0.1
   : 

   We can similarly look at the GHC instance for the Stack example project to
   see that it doesn't provide third-party Haskell dependencies:

   #+NAME: example-stack-pkg-list
   #+BEGIN_SRC shell :results output :exports both
     cd examples/example-stack
     nix-shell --pure --run 'ghc-pkg list text-icu'
   #+END_SRC

   #+RESULTS: example-stack-pkg-list
   : /nix/store/pi09aqrn49aryhdqy1h62czz7x0z57g8-ghc-8.8.4/lib/ghc-8.8.4/package.conf.d
   :     (no packages)

   This leads to a complication with Cabal projects when using Nix.  Changing
   the dependencies of a Cabal file mean we need to rebuild the package database
   that our project's Nix shell provides.

   We'll need to enter into a new Nix shell to get a new environment with our
   rebuilt the package database.  We'll also need to restart the HLS instance
   process in our editor to pick up this new database from the new environment.

   The problem described above applies specifically to Cabal-based projects that
   use a Nix shell.  Unfortunately, there's a few known issues of [[haskell-hls-issue-detect][HLS not
   responding dynamically to changing dependencies]].  So when dependencies
   change, we may find we have to restart the HLS instance for the project, even
   with Stack-based projects.

   This need to reenter Nix shell and restart HLS is inconvenient.  Hopefully it
   can be addressed with future development.  Fortunately, changing packages
   dependencies is not too common when developing a program.

   Whatever editor you use, we recommend getting to know how to restart HLS for
   any project you have open.

* Building with Nix

  When we run HLS, we are only using Nix to manage tools and dependencies needed
  for compilation.  This is good for iterative development of a Haskell project.
  Local building happens in typical directories local to the project
  (specifically, =.stack-work= for Stack and =dist-newstyle= for Cabal)

  We can, though, have Nix build our final application.  Cabal and Stack have
  gone through great degrees of improvements to be more Nix-like, but Nix was
  built from the ground up to give us highly reproducible builds.  When we build
  an application with Nix, this build ends up in =/nix/store=.  Furthermore, all
  intermediate steps of the build are performed in a heavily isolated
  environment that limits filesystem and network access.

  Both the example Cabal and Stack projects provide =default.nix= files that
  enable us to build these project with Nix using subcommands of the =nix=
  command-line tool, specifically =nix build=.  If you're new to Nix, see [[file:doc/nix.org][the
  provided documentation on Nix]] for more about using =nix build=, =nix run=, and
  other commands.

  When going through the Nix expressions in the example projects, notice how the
  Nix expressions we use for Nix shells shares common code with Nix expressions
  we use for building with =nix build=.  This is often the case.

  For the Stack example project, we use literally the same code in =default.nix=
  file for both building as well as specifying dependencies for a Nix shell.
  The Cabal example project has common Nix expressions are in =build.nix=, which
  support the =default.nix= file for building as well as the =shell.nix= file
  used for the project's Nix shell.

  Since both of these projects have a dependency on the ICU C library, there's a
  good chance you don't have it installed in your system such that Cabal or
  Stack can find it.  =cabal build= and =stack build= would fail not finding the
  necessary library.  If we want to use normal =cabal= or =stack= calls, we'll
  need to do that in =nix-shell= as discussed in a previous section.

  But because our projects have Nix expressions for building, we can build and
  run them with Nix irrespective of the state of our user environment.  Here's a
  run of our example Cabal project:

  #+NAME: example-cabal-run
  #+BEGIN_SRC shell :results output :exports both
     nix run \
         --file examples/example-cabal \
         --command example-haskell
  #+END_SRC

  #+RESULTS: example-cabal-run
  : Answer to the Ultimate Question of Life,
  :     the Universe, and Everything: 42

  Building and running Stack projects within Nix involve a relaxation to Nix's
  default sandboxing, but otherwise runs similarly:

  #+NAME: example-stack-run
  #+BEGIN_SRC shell :results output :exports both
     nix run \
         --option sandbox relaxed \
         --file examples/example-stack \
         --command example-haskell
  #+END_SRC

  #+RESULTS: example-stack-run
  : Answer to the Ultimate Question of Life,
  :     the Universe, and Everything: 42

